name: "depth_unet_trt"
platform: "tensorrt_plan"
max_batch_size: 8

input  [{ name: "INPUT__0"  data_type: TYPE_FP16 dims: [3, 224, 224] }]
output [{ name: "OUTPUT__0" data_type: TYPE_FP16 dims: [1, 224, 224] }]

instance_group [{ kind: KIND_GPU, count: 1 }]

dynamic_batching {
  preferred_batch_size: [4,8]
  max_queue_delay_microseconds: 20000
}
